code-review/NRB_3471_3546/База_Было/Reports/РегуляторнаяОтчетность_Форма_0409405_4_0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РегуляторнаяОтчетность_Форма_0409405_4_0</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеПодраздела_1_2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РегнКОФил</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомСтроки2</Name>
							<Comment>2</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОпер</Name>
							<Comment>3</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВидВалОпер</Name>
							<Comment>4</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодИнструмента</Name>
							<Comment>5</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОп</Name>
							<Comment>6</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодНПл</Name>
							<Comment>7</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолЦб</Name>
							<Comment>8</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерДоли</Name>
							<Comment>9</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВлПл</Name>
							<Comment>10</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Comment>11</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоход</Name>
							<Comment>12</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Comment>13</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К1</Name>
							<Comment>К1</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаимРезидент</Name>
							<Comment>14</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодРезидент</Name>
							<Comment>15</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К2</Name>
							<Comment>К2</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаимНерезидент</Name>
							<Comment>16</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраны</Name>
							<Comment>17</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>N1</Name>
							<Comment>N1 (не заполняем)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К3</Name>
							<Comment>К3</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаимЭмЦб</Name>
							<Comment>18</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЭмЦб</Name>
							<Comment>19</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегНомЦб</Name>
							<Comment>20</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегВып</Name>
							<Comment>21</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПогашЦб</Name>
							<Comment>22</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВлЦб</Name>
							<Comment>23</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Comment>24 (не заполняем)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримРАССРОЧКА</Name>
							<Comment>(не заполняем)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримПАКЕТ</Name>
							<Comment>(не заполняем)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримТЕКСТ</Name>
							<Comment>(не заполняем)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримКАНаимИнБ</Name>
							<Comment>(не заполняем)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримКАКодСтраныИнБ</Name>
							<Comment>(не заполняем)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримКАНаимНРзд</Name>
							<Comment>(не заполняем)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримКАКодСтраныНРзд</Name>
							<Comment>(не заполняем)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримСобствБум</Name>
							<Comment>(не заполняем)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ЮридическиеЛицаМеждународныеКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЮридическиеЛицаМеждународныеКомпании</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакРегистрацииМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакРегистрацииМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/НоминалЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НоминалЦБ</Name>
			<Comment>Номинал ЦБ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма номинала</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>ЦБ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/КатегорииРолейКлиентовСогласноУказов81и95.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорииРолейКлиентовСогласноУказов81и95</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КатегорияРоли</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРолейКлиентовСогласноУказов81и95</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Reports/РегуляторнаяОтчетность_Форма_0409405_4_0/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура заполняет данными ТЧ ДанныеПодраздела_1_2 и параметр ДанныеДляРасшифровки
// Параметры:
//	ДанныеДляРасшифровки - ТаблицаЗначений - возвращаемый параметр, в котором возвращается таблица значений
//
// BSLLS:MethodSize-off
Процедура ПолучитьДанные(ДанныеДляРасшифровки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	// Также важно что реквизит Резидент в справочнике контрагентов, как это ни парадоксально, означает "Нерезидент по документам"
	// - живите теперь с этим, если не знали раньше
	"ВЫБРАТЬ
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.МеждународнаяКомпания КАК МеждународнаяКомпания,
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.ЮридическоеЛицо КАК ЮридическоеЛицо,
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.ПризнакРегистрацииМеждународнойКомпании КАК ПризнакРегистрацииМК
	|ПОМЕСТИТЬ ВТ_МеждународныеКомпании
	|ИЗ
	|	РегистрСведений.ЮридическиеЛицаМеждународныеКомпании.СрезПоследних(&ПериодКонец, 1 = 1) КАК ЮридическиеЛицаМеждународныеКомпанииСрезПоследних
	|ГДЕ
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.МеждународнаяКомпания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Поручение.БанковскийСчет.НомерСчета) КАК ДоходПеречисленНа,
	|	ГлобальнаяОперация.Ссылка КАК Документ,
	|	ГлобальнаяОперация.Дата КАК Период,
	|	ГлобальнаяОперация.ВидГлобальнойОперации КАК ВидОперации,
	|	ГлобальнаяОперация.СчетДепо КАК СчетДепо,
	|	Поручение.Ссылка КАК Поручение,
	|	МАКСИМУМ(Депоненты.Ссылка) КАК Депонент,
	|	МАКСИМУМ(ГлобальнаяОперация.БанковскийСчет) КАК БанковскийСчет,
	|	ГлобальнаяОперацияЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	МАКСИМУМ(ЕСТЬNULL(ЭмитентыБазовыхАктивовДепозитарныхРасписок.Ссылка, Эмитенты.Ссылка)) КАК Эмитент,
	|	МАКСИМУМ(БазовыеАктивыДепозитарныхРасписок.Ссылка) КАК БазовыйАктивДепозитарнойРасписки,
	|	НАЧАЛОПЕРИОДА(МАКСИМУМ(ГлобальнаяОперация.Дата), ДЕНЬ) КАК ДатаОпер,
	|	СУММА(ГлобальнаяОперацияЦенныеБумаги.Количество) КАК КолЦб,
	|	СУММА(ГлобальнаяОперацияЦенныеБумаги.Сумма) КАК Сумма,
	|	СУММА(ГлобальнаяОперацияЦенныеБумаги.СуммаБезНалога) КАК СуммаВсего,
	|	СУММА(ВЫБОР
	|			КОГДА ГлобальнаяОперация.ВидГлобальнойОперации В (&ВидыОперацийНеПроценты)
	|				ТОГДА 0
	|			ИНАЧЕ ГлобальнаяОперацияЦенныеБумаги.СуммаБезНалога
	|		КОНЕЦ) КАК СуммаДоход,
	|	СУММА(ГлобальнаяОперацияЦенныеБумаги.СуммаНалога) КАК Налог,
	|	МАКСИМУМ(НЕ ДепонентыМеждународныеКомпании.ЮридическоеЛицо ЕСТЬ NULL) КАК ДепонентПроверкаМК,
	|	МАКСИМУМ(НЕ ЭмитентыМеждународныеКомпании.ЮридическоеЛицо ЕСТЬ NULL) КАК ЭмитентПроверкаМК,
	|	МАКСИМУМ(Депоненты.Резидент) КАК ДепонентНеРезидент,
	|	МАКСИМУМ(Эмитенты.Резидент) КАК ЭмитентНеРезидент
	|ПОМЕСТИТЬ ВТ_ОперацииЗаПериод
	|ИЗ
	|	Документ.ГлобальнаяОперация КАК ГлобальнаяОперация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГлобальнаяОперация.ЦенныеБумаги КАК ГлобальнаяОперацияЦенныеБумаги
	|		ПО (ГлобальнаяОперацияЦенныеБумаги.Ссылка = ГлобальнаяОперация.Ссылка)
	|			И (ГлобальнаяОперация.Проведен)
	|			И (ГлобальнаяОперация.Дата МЕЖДУ &ПериодНачало И &ПериодКонец)
	|			И (ГлобальнаяОперация.ВидГлобальнойОперации В (&ВидыОпераций))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК Поручение
	|		ПО ГлобальнаяОперация.ДокументОснование = Поручение.Ссылка
	|			И ГлобальнаяОперация.СчетДепо = Поручение.СчетДепо
	|			И (ГлобальнаяОперацияЦенныеБумаги.РазделСчетаДепо = Поручение.РазделСчетаДепо)
	|			И (ГлобальнаяОперацияЦенныеБумаги.СчетДепоМХ = Поручение.СчетДепоМХ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО ГлобальнаяОперация.СчетДепо = СчетаДепо.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Депоненты
	|		ПО (СчетаДепо.Владелец = Депоненты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ДепонентыЮридическиеЛица
	|		ПО Депоненты.ЮридическиеФизическиеЛица = ДепонентыЮридическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МеждународныеКомпании КАК ДепонентыМеждународныеКомпании
	|		ПО ДепонентыЮридическиеЛица.Ссылка = ДепонентыМеждународныеКомпании.ЮридическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК СправочникЦенныеБумаги
	|		ПО (ГлобальнаяОперацияЦенныеБумаги.ЦеннаяБумага = СправочникЦенныеБумаги.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Эмитенты
	|		ПО (СправочникЦенныеБумаги.Эмитент = Эмитенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЭмитентыЮридическиеЛица
	|		ПО Эмитенты.ЮридическиеФизическиеЛица = ЭмитентыЮридическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МеждународныеКомпании КАК ЭмитентыМеждународныеКомпании
	|		ПО ЭмитентыЮридическиеЛица.Ссылка = ЭмитентыМеждународныеКомпании.ЮридическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК БазовыеАктивыДепозитарныхРасписок
	|		ПО (СправочникЦенныеБумаги.БазовыйАктив = БазовыеАктивыДепозитарныхРасписок.Ссылка)
	|			И (СправочникЦенныеБумаги.ТипЦБ В (&ТипыДепозитарныхРасписок))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ЭмитентыБазовыхАктивовДепозитарныхРасписок
	|		ПО (БазовыеАктивыДепозитарныхРасписок.Эмитент = ЭмитентыБазовыхАктивовДепозитарныхРасписок.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГлобальнаяОперация.Ссылка,
	|	ГлобальнаяОперация.Дата,
	|	ГлобальнаяОперация.ВидГлобальнойОперации,
	|	ГлобальнаяОперация.СчетДепо,
	|	Поручение.Ссылка,
	|	ГлобальнаяОперацияЦенныеБумаги.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОперацииЗаПериод.ДоходПеречисленНа КАК ДоходПеречисленНа,
	|	ВТ_ОперацииЗаПериод.Документ КАК Документ,
	|	ВТ_ОперацииЗаПериод.Период КАК Период,
	|	ВТ_ОперацииЗаПериод.ВидОперации КАК ВидОперации,
	|	ВТ_ОперацииЗаПериод.СчетДепо КАК СчетДепо,
	|	ВТ_ОперацииЗаПериод.Поручение КАК Поручение,
	|	ВТ_ОперацииЗаПериод.Депонент КАК Депонент,
	|	ВТ_ОперацииЗаПериод.БанковскийСчет КАК БанковскийСчет,
	|	ВТ_ОперацииЗаПериод.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_ОперацииЗаПериод.Эмитент КАК Эмитент,
	|	ВТ_ОперацииЗаПериод.БазовыйАктивДепозитарнойРасписки КАК БазовыйАктивДепозитарнойРасписки,
	|	ВТ_ОперацииЗаПериод.ДатаОпер КАК ДатаОпер,
	|	ВТ_ОперацииЗаПериод.КолЦб КАК КолЦб,
	|	ВТ_ОперацииЗаПериод.Сумма КАК Сумма,
	|	ВТ_ОперацииЗаПериод.СуммаВсего КАК СуммаВсего,
	|	ВТ_ОперацииЗаПериод.СуммаДоход КАК СуммаДоход,
	|	ВТ_ОперацииЗаПериод.Налог КАК Налог,
	|	ВЫБОР
	|			КОГДА ВТ_ОперацииЗаПериод.ДепонентНеРезидент
	|					И НЕ ВТ_ОперацииЗаПериод.ДепонентПроверкаМК
	|					И НЕ ВТ_ОперацииЗаПериод.ЭмитентНеРезидент
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ОперацииЗаПериод.ДепонентНеРезидент
	|					И НЕ ВТ_ОперацииЗаПериод.ДепонентПроверкаМК
	|					И ВТ_ОперацииЗаПериод.ЭмитентНеРезидент
	|					И ВТ_ОперацииЗаПериод.ЭмитентПроверкаМК
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ОперацииЗаПериод.ЭмитентНеРезидент
	|					И НЕ ВТ_ОперацииЗаПериод.ЭмитентПроверкаМК
	|					И НЕ ВТ_ОперацииЗаПериод.ДепонентНеРезидент
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ОперацииЗаПериод.ЭмитентНеРезидент
	|					И НЕ ВТ_ОперацииЗаПериод.ЭмитентПроверкаМК
	|					И ВТ_ОперацииЗаПериод.ДепонентНеРезидент
	|					И ВТ_ОперацииЗаПериод.ДепонентПроверкаМК
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьВОтчет
	|ПОМЕСТИТЬ ВТ_Операции
	|ИЗ
	|	ВТ_ОперацииЗаПериод КАК ВТ_ОперацииЗаПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Операции.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_Операции.БазовыйАктивДепозитарнойРасписки КАК БазовыйАктивДепозитарнойРасписки
	|ПОМЕСТИТЬ ВТ_ЦБ
	|ИЗ
	|	ВТ_Операции КАК ВТ_Операции
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Операции.ЦеннаяБумага,
	|	ВТ_Операции.БазовыйАктивДепозитарнойРасписки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоминалЦБСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	|	НоминалЦБСрезПоследних.Сумма КАК Номинал
	|ПОМЕСТИТЬ ВТ_НоминалДепозитарныхРасписок
	|ИЗ
	|	РегистрСведений.НоминалЦБ.СрезПоследних(
	|			&ОтчетнаяДата,
	|			ЦеннаяБумага В
	|				(ВЫБРАТЬ
	|					ВТ_ЦБ.БазовыйАктивДепозитарнойРасписки КАК БазовыйАктив
	|				ИЗ
	|					ВТ_ЦБ КАК ВТ_ЦБ
	|				ГДЕ
	|					НЕ ВТ_ЦБ.БазовыйАктивДепозитарнойРасписки ЕСТЬ NULL)) КАК НоминалЦБСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК РегНомер,
	|	ЦенныеБумаги.Эмитент.Наименование КАК ЭмитентНаименование,
	|	ЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	|	ЦенныеБумаги.Наименование КАК Наименование,
	|	ВТ_ЦБ.БазовыйАктивДепозитарнойРасписки КАК БазовыйАктивДепозитарнойРасписки,
	|	ВТ_НоминалДепозитарныхРасписок.Номинал КАК НоминалДепозитарнойРасписки,
	|	ЦенныеБумаги.ВидЦББанкаРоссии КАК ВидЦББанкаРоссии,
	|	ВЫБОР
	|		КОГДА ВидыЦББанкаРоссии.Код ЕСТЬ NULL
	|			ТОГДА ""OTH2""
	|		ИНАЧЕ ВидыЦББанкаРоссии.Код
	|	КОНЕЦ КАК КодИнструмента,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ЦБ.БазовыйАктивДепозитарнойРасписки ЕСТЬ NULL
	|				И ЕСТЬNULL(ВТ_НоминалДепозитарныхРасписок.Номинал, 0) = 0
	|			ТОГДА ИСТИНА
	|		КОГДА ВТ_ЦБ.БазовыйАктивДепозитарнойРасписки ЕСТЬ NULL
	|				И ВидыЦББанкаРоссии.Код В (&КодыБезВалюты)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВалютаНоминалаНеТребуется,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ЦБ.БазовыйАктивДепозитарнойРасписки ЕСТЬ NULL
	|				И ЕСТЬNULL(ВТ_НоминалДепозитарныхРасписок.Номинал, 0) <> 0
	|			ТОГДА ВалютыНоминалаБазовыхАктивовДепозитарныхРасписок.Код
	|		КОГДА ВТ_ЦБ.БазовыйАктивДепозитарнойРасписки ЕСТЬ NULL
	|				И НЕ ВидыЦББанкаРоссии.Код В (&КодыБезВалюты)
	|			ТОГДА ВалютыНоминала.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВалютыНоминала
	|ПОМЕСТИТЬ ВТ_ИнформацияОЦенныхБумагах
	|ИЗ
	|	ВТ_ЦБ КАК ВТ_ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ВТ_ЦБ.ЦеннаяБумага = ЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК БазовыеАктивыДепозитарныхРасписок
	|		ПО (ЦенныеБумаги.БазовыйАктив = БазовыеАктивыДепозитарныхРасписок.Ссылка)
	|			И (НЕ ВТ_ЦБ.БазовыйАктивДепозитарнойРасписки ЕСТЬ NULL)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦББанкаРоссии КАК ВидыЦББанкаРоссии
	|		ПО (ЦенныеБумаги.ВидЦББанкаРоссии = ВидыЦББанкаРоссии.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыНоминала
	|		ПО (ЦенныеБумаги.ВалютаНоминала = ВалютыНоминала.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НоминалДепозитарныхРасписок КАК ВТ_НоминалДепозитарныхРасписок
	|		ПО ВТ_ЦБ.БазовыйАктивДепозитарнойРасписки = ВТ_НоминалДепозитарныхРасписок.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыНоминалаБазовыхАктивовДепозитарныхРасписок
	|		ПО (БазовыеАктивыДепозитарныхРасписок.ВалютаНоминала = ВалютыНоминалаБазовыхАктивовДепозитарныхРасписок.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Операции.Депонент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_Депоненты
	|ИЗ
	|	ВТ_Операции КАК ВТ_Операции
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Операции.Депонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КатегорииРолейКлиентовСогласноУказов81и95СрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
	|	КатегорииРолейКлиентовСогласноУказов81и95СрезПоследних.КатегорияРоли КАК КатегорияРоли
	|ПОМЕСТИТЬ ВТ_КатегорииРолейДепонентов
	|ИЗ
	|	РегистрСведений.КатегорииРолейКлиентовСогласноУказов81и95.СрезПоследних(&ПериодКонец, 1 = 1) КАК КатегорииРолейКлиентовСогласноУказов81и95СрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДепонентыИЭмитенты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ДепонентыИЭмитенты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Операции.Депонент КАК Контрагент
	|	ИЗ
	|		ВТ_Операции КАК ВТ_Операции
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Операции.Эмитент
	|	ИЗ
	|		ВТ_Операции КАК ВТ_Операции) КАК ДепонентыИЭмитенты
	|
	|СГРУППИРОВАТЬ ПО
	|	ДепонентыИЭмитенты.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДепонентыИЭмитенты.Контрагент КАК Контрагент,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.Резидент КАК НеРезидент,
	|	Контрагенты.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	Контрагенты.ЮрФизЛицо КАК ЮрФизЛицо,
	|	ЕСТЬNULL(ЮридическиеЛица.ИНН, ФизическиеЛица.ИНН) КАК ИНН,
	|	ВТ_КатегорииРолейДепонентов.КатегорияРоли КАК КатегорияРоли,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_МеждународныеКомпании.ЮридическоеЛицо ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоМеждународнаяКомпания,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_МеждународныеКомпании.ЮридическоеЛицо ЕСТЬ NULL
	|			ТОГДА ""996""
	|		КОГДА ЮридическиеЛица.МеждународнаяОрганизация = ИСТИНА
	|			ТОГДА ""998""
	|		ИНАЧЕ ЕСТЬNULL(КлассификаторСтранМира.Код, ""999"")
	|	КОНЕЦ КАК КодСтраны,
	|	ЕСТЬNULL(ЮридическиеЛица.КредитнаяОрганизация, Ложь) КАК КредитнаяОрганизация,
	|	ЕСТЬNULL(ЮридическиеЛица.РегНомер, """") КАК РегНомер,
	|	НЕ ВТ_МеждународныеКомпании.ЮридическоеЛицо ЕСТЬ NULL КАК ПроверкаМК,
	|	ВТ_МеждународныеКомпании.ПризнакРегистрацииМК КАК ПризнакРегистрацииМК,
	|	ЕСТЬNULL(ФизическиеЛица.ПБОЮЛ, Ложь) КАК ПБОЮЛ
	|ПОМЕСТИТЬ ВТ_ИнформацияОДепонентахИЭмитентах
	|ИЗ
	|	ВТ_ДепонентыИЭмитенты КАК ВТ_ДепонентыИЭмитенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_ДепонентыИЭмитенты.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО Контрагенты.ЮридическиеФизическиеЛица = ФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МеждународныеКомпании КАК ВТ_МеждународныеКомпании
	|		ПО ЮридическиеЛица.Ссылка = ВТ_МеждународныеКомпании.ЮридическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО Контрагенты.РегионДляОтчетов = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КатегорииРолейДепонентов КАК ВТ_КатегорииРолейДепонентов
	|		ПО Контрагенты.ЮридическиеФизическиеЛица = ВТ_КатегорииРолейДепонентов.ЮрФизЛицо
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Операции.Документ КАК Документ,
	|	ВТ_Операции.Депонент КАК Депонент,
	|	Депоненты.НеРезидент КАК ДепонентыНеРезидент,
	|	ВТ_Операции.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_Операции.Эмитент КАК Эмитент,
	|	Эмитенты.НеРезидент КАК ЭмитентНеРезидент,
	|	&НомерЛицензииБанка КАК РегнКОФил,															// 0
	|																								// 1  НомСтроки2 заполняется процедурно
	|	ВТ_Операции.ДатаОпер КАК ДатаОпер,															// 2
	|	ВЫБОР
	|		КОГДА Депоненты.НеРезидент
	|				И (Депоненты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ИЛИ НЕ Депоненты.ЭтоМеждународнаяКомпания) 
	|				И (НЕ Эмитенты.НеРезидент 
	|					ИЛИ (Эмитенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) И Эмитенты.ЭтоМеждународнаяКомпания))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ЦенныеБумаги.ТипЦБ В (&ТипыЦБ_55211) 
	|						ТОГДА ""55211""
	|					КОГДА ЦенныеБумаги.ТипЦБ  = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Пай)
	|						ТОГДА ""55230""
	|					КОГДА ЦенныеБумаги.ТипЦБ  = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Акция)
	|							И Депоненты.КатегорияРоли = &ИнострРезидентКонтрольИнострНедружественный
	|						ТОГДА ""50111""
	|					КОГДА ЦенныеБумаги.ТипЦБ  = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Акция)
	|							И (Депоненты.КатегорияРоли = &ИнострРезидентКонтрольИнострДружественный
	|								ИЛИ Депоненты.КатегорияРоли = &ИнострРезидентОтвечаетТребованиямПункта12Указа95)
	|						ТОГДА ""50112""
	|					ИНАЧЕ ""99999""
	|				КОНЕЦ
	|		КОГДА Эмитенты.НеРезидент
	|				И (Эмитенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ИЛИ НЕ Эмитенты.ЭтоМеждународнаяКомпания)
	|				И (НЕ Депоненты.НеРезидент
	|					ИЛИ Депоненты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) И Депоненты.ЭтоМеждународнаяКомпания)
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ЦенныеБумаги.ТипЦБ В (&ТипыЦБ_55310)
	|						ТОГДА ""55310""
	|					КОГДА ЦенныеБумаги.ТипЦБ  = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Пай)
	|						ТОГДА ""55330""
	|					ИНАЧЕ ""99999""
	|				КОНЕЦ
	|		ИНАЧЕ ""99999""
	|	КОНЕЦ КАК КодВидВалОпер,																	// 3
	|	ВЫБОР
	|		КОГДА Эмитенты.НеРезидент И Эмитенты.ПроверкаМК
	|			И (Эмитенты.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.Редомициляция))
	|			И ВТ_ИнформацияОЦенныхБумагах.КодИнструмента = ""SHS6""
	|		 	ТОГДА ""SHS3""
	|		ИНАЧЕ ВТ_ИнформацияОЦенныхБумагах.КодИнструмента
	|	КОНЕЦ КАК КодИнструмента,																	// 4
	|	""99"" КАК КодОп,																			// 5
	|	ВЫБОР
	|		КОГДА Депоненты.НеРезидент
	|			ТОГДА ""OUTR""
	|		ИНАЧЕ ""INR""
	|	КОНЕЦ КАК КодНПл,																			// 6
	|	ВТ_Операции.КолЦб КАК КолЦб,																// 7
	|																								// 8  РазмерДоли не заполняется
	|	ВалютыПлатежа.Код КАК КодВлПл, 																// 9
	|	ВТ_Операции.СуммаВсего КАК СуммаВсего,														// 10
	|	ВТ_Операции.СуммаДоход КАК СуммаДоход,														// 11
	|	ВТ_Операции.Налог КАК Налог,																// 12
	|	ВЫБОР
	|		КОГДА НЕ Эмитенты.НеРезидент
	|				ИЛИ Эмитенты.НеРезидент
	|					И Эмитенты.ПроверкаМК
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ Эмитенты.КредитнаяОрганизация
	|						ТОГДА ""1""
	|					ИНАЧЕ ""2""
	|				КОНЕЦ
	|		КОГДА НЕ Депоненты.НеРезидент
	|				ИЛИ Депоненты.НеРезидент
	|					И Депоненты.ПроверкаМК
	|			ТОГДА ВЫБОР
	|					КОГДА Депоненты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|						ТОГДА ВЫБОР
	|								КОГДА НЕ Депоненты.КредитнаяОрганизация
	|									ТОГДА ""1""
	|								ИНАЧЕ ""2""
	|							КОНЕЦ
	|					КОГДА Депоненты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|						ТОГДА ВЫБОР
	|								КОГДА НЕ Депоненты.ПБОЮЛ
	|									ТОГДА ""3""
	|								ИНАЧЕ ""4""
	|							КОНЕЦ
	|				КОНЕЦ
	|	КОНЕЦ КАК К1,																				// К1
	|	ВЫБОР
	|		КОГДА НЕ Эмитенты.НеРезидент
	|				ИЛИ Эмитенты.НеРезидент
	|					И Эмитенты.ПроверкаМК
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ИнформацияОЦенныхБумагах.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Пай)
	|						ТОГДА ВТ_ИнформацияОЦенныхБумагах.ЭмитентНаименование + "" ("" + ВТ_ИнформацияОЦенныхБумагах.Наименование + "")""
	|					ИНАЧЕ ВТ_ИнформацияОЦенныхБумагах.ЭмитентНаименование
	|				КОНЕЦ
	|		КОГДА НЕ Депоненты.НеРезидент
	|				ИЛИ Депоненты.НеРезидент
	|					И Депоненты.ПроверкаМК
	|			ТОГДА ВЫБОР
	|					КОГДА Депоненты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|							И НЕ Депоненты.ПБОЮЛ
	|						ТОГДА ""ФЛ""
	|					ИНАЧЕ Депоненты.Наименование
	|				КОНЕЦ
	|	КОНЕЦ КАК НаимРезидент,																		// 13
	|	ВЫБОР
	|		КОГДА НЕ Эмитенты.НеРезидент
	|				ИЛИ Эмитенты.НеРезидент
	|					И Эмитенты.ПроверкаМК
	|			ТОГДА ВЫБОР
	|					КОГДА Эмитенты.КредитнаяОрганизация
	|						ТОГДА Эмитенты.РегНомер
	|					ИНАЧЕ Эмитенты.ИНН
	|				КОНЕЦ
	|		КОГДА НЕ Депоненты.НеРезидент
	|				ИЛИ Депоненты.НеРезидент
	|					И Депоненты.ПроверкаМК
	|			ТОГДА ВЫБОР
	|					КОГДА Депоненты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|						ТОГДА ВЫБОР
	|								КОГДА Депоненты.КредитнаяОрганизация
	|									ТОГДА Депоненты.РегНомер
	|								ИНАЧЕ Депоненты.ИНН
	|							КОНЕЦ
	|				КОНЕЦ
	|	КОНЕЦ КАК КодРезидент,																		// 14
	|	ВЫБОР
	|		КОГДА Депоненты.Нерезидент И Депоненты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ""2""
	|		КОГДА Эмитенты.Нерезидент И Эмитенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ""2""
	|		ИНАЧЕ ""1""
	|	КОНЕЦ КАК К2,																				// К2
	|	ВЫБОР
	|		КОГДА Эмитенты.НеРезидент
	|				И НЕ Эмитенты.ПроверкаМК
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ИнформацияОЦенныхБумагах.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Пай)
	|						ТОГДА ВТ_ИнформацияОЦенныхБумагах.ЭмитентНаименование + "" ("" + ВТ_ИнформацияОЦенныхБумагах.Наименование + "")""
	|					ИНАЧЕ ВТ_ИнформацияОЦенныхБумагах.ЭмитентНаименование
	|				КОНЕЦ
	|		КОГДА Депоненты.НеРезидент
	|				И НЕ Депоненты.ПроверкаМК
	|			ТОГДА ВЫБОР
	|					КОГДА Депоненты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|						ТОГДА ""ФЛ""
	|					ИНАЧЕ Депоненты.Наименование
	|				КОНЕЦ
	|	КОНЕЦ КАК НаимНерезидент,																	// 15
	|	ВЫБОР
	|		КОГДА Эмитенты.НеРезидент
	|				И НЕ Эмитенты.ПроверкаМК
	|			ТОГДА Эмитенты.КодСтраны
	|		КОГДА Депоненты.НеРезидент
	|				И НЕ Депоненты.ПроверкаМК
	|			ТОГДА Депоненты.КодСтраны
	|	КОНЕЦ КАК КодСтраны,																		// 16
	|	ВЫБОР
	|		КОГДА НЕ Эмитенты.НеРезидент
	|			ТОГДА ""2""
	|		КОГДА Эмитенты.НеРезидент
	|				И Эмитенты.ПроверкаМК
	|			ТОГДА ""2""
	|		КОГДА Эмитенты.НеРезидент
	|				И НЕ Эмитенты.ПроверкаМК
	|			ТОГДА ""3""
	|	КОНЕЦ КАК К3,																				// К3
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Пай)
	|			ТОГДА Эмитенты.Наименование + ""("" + ЦенныеБумаги.Наименование + "")""
	|		ИНАЧЕ Эмитенты.Наименование
	|	КОНЕЦ КАК НаимЭмЦб,																			// 17
	|	ВЫБОР
	|		КОГДА НЕ Эмитенты.НеРезидент
	|			ТОГДА Эмитенты.ИНН
	|		КОГДА Эмитенты.НеРезидент
	|				И Эмитенты.ПроверкаМК
	|			ТОГДА Эмитенты.ИНН
	|		КОГДА Эмитенты.НеРезидент
	|				И НЕ Эмитенты.ПроверкаМК
	|			ТОГДА Эмитенты.КодСтраны
	|	КОНЕЦ КАК КодЭмЦб,																			// 18
	|	ЦенныеБумаги.НомерРегистрации КАК РегНомЦб,													// 19
	|	ЦенныеБумаги.ДатаГосРег КАК ДатаРегВып,														// 20
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
	|			ТОГДА ЦенныеБумаги.ДатаПогашения
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
	|	КОНЕЦ КАК ДатаПогашЦб,																		// 21
	|	ВТ_ИнформацияОЦенныхБумагах.КодВалютыНоминала КАК КодВлЦб,									// 22
	|	ВТ_Операции.ДоходПеречисленНа КАК ПримТЕКСТ													// 23
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_Операции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО ВТ_Операции.БанковскийСчет = БанковскиеСчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыПлатежа
	|		ПО БанковскиеСчета.ВалютаДенежныхСредств = ВалютыПлатежа.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияОДепонентахИЭмитентах КАК Депоненты
	|		ПО (ВТ_Операции.Депонент = Депоненты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО (ВТ_Операции.ЦеннаяБумага = ЦенныеБумаги.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияОЦенныхБумагах КАК ВТ_ИнформацияОЦенныхБумагах
	|		ПО (ВТ_Операции.ЦеннаяБумага = ВТ_ИнформацияОЦенныхБумагах.ЦеннаяБумага)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияОДепонентахИЭмитентах КАК Эмитенты
	|		ПО (ВТ_Операции.Эмитент = Эмитенты.Контрагент)
	|ГДЕ
	|	ВТ_Операции.ВключатьВОтчет
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК НомСтр,
	|	ВТ_Операции.ВключатьВОтчет КАК ВключатьВОтчет,
	|	ВТ_Операции.Период КАК Период,
	|	ВТ_Операции.Поручение КАК Поручение,
	|	ВТ_Операции.Документ КАК ГлобальнаяОперация,
	|	ВТ_Операции.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_Операции.ВидОперации КАК ВидОперации,
	|	ВТ_Операции.Депонент КАК Владелец,
	|	ВТ_Операции.СчетДепо КАК СчетДепо,
	|	Депоненты.НеРезидент КАК ДепонентНеРезидент,
	|	ВТ_ИнформацияОЦенныхБумагах.Наименование КАК НаименованиеЦБ,
	|	ВТ_ИнформацияОЦенныхБумагах.ISIN КАК ISIN,
	|	ВТ_ИнформацияОЦенныхБумагах.ВидЦББанкаРоссии КАК ВидЦББанкаРоссии,
	|	ВТ_Операции.КолЦб КАК КолЦб,
	|	ВЫБОР
	|		КОГДА Эмитенты.НеРезидент
	|			ТОГДА ""Нерезидент""
	|		ИНАЧЕ ""Резидент""
	|	КОНЕЦ КАК РезидентствоЭмитента,
	|	Эмитенты.ЭтоМеждународнаяКомпания КАК ЭмитентМеждународнаяКомпания,
	|	ВТ_Операции.Сумма КАК Сумма,
	|	ВТ_Операции.СуммаВсего КАК СуммаКВыплате,
	|	ВТ_Операции.Налог КАК СуммаНалога,
	|	ВТ_Операции.ДоходПеречисленНа КАК СчетДляВыплатыДохода
	|ИЗ
	|	ВТ_Операции КАК ВТ_Операции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияОДепонентахИЭмитентах КАК Депоненты
	|		ПО Депоненты.Контрагент = ВТ_Операции.Депонент
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияОДепонентахИЭмитентах КАК Эмитенты
	|		ПО ВТ_Операции.Эмитент = Эмитенты.Контрагент
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияОЦенныхБумагах КАК ВТ_ИнформацияОЦенныхБумагах
	|		ПО ВТ_ИнформацияОЦенныхБумагах.ЦеннаяБумага = ВТ_Операции.ЦеннаяБумага
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Операции.Период,
	|	ВТ_Операции.Документ
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнформацияОЦенныхБумагах.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_ИнформацияОЦенныхБумагах.ISIN КАК ISIN,
	|	ВТ_ИнформацияОЦенныхБумагах.РегНомер КАК РегНомер,
	|	ВТ_ИнформацияОЦенныхБумагах.КодВалютыНоминала КАК КодВалютыНоминала,
	|	ВТ_ИнформацияОЦенныхБумагах.ВалютаНоминалаНеТребуется КАК ВалютаНоминалаНеТребуется,
	|	ВТ_ИнформацияОЦенныхБумагах.БазовыйАктивДепозитарнойРасписки КАК БазовыйАктивДепозитарнойРасписки,
	|	ВТ_ИнформацияОЦенныхБумагах.НоминалДепозитарнойРасписки КАК НоминалДепозитарнойРасписки
	|ИЗ
	|	ВТ_ИнформацияОЦенныхБумагах
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Депонент КАК Депонент,
	|	ВТ_Результат.Эмитент КАК Эмитент,
	|	ВТ_Результат.ДепонентыНеРезидент КАК ДепонентыНеРезидент,
	|	ВТ_Результат.КодСтраны КАК КодСтраны
	|ИЗ
	|	ВТ_Результат
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Результат.Депонент,
	|	ВТ_Результат.Эмитент,
	|	ВТ_Результат.ДепонентыНеРезидент,
	|	ВТ_Результат.КодСтраны
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.ЦеннаяБумага КАК ЦеннаяБумага,
	|	МАКСИМУМ(ВТ_Результат.Эмитент) КАК Эмитент,
	|	МАКСИМУМ(ВТ_Результат.ЭмитентНеРезидент) КАК ЭмитентНеРезидент,
	|	МАКСИМУМ(ВТ_Результат.КодЭмЦб) КАК КодЭмЦб,
	|	МАКСИМУМ(ВТ_Результат.КодВлЦб) КАК КодВлЦб
	|ИЗ ВТ_Результат
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Результат.ЦеннаяБумага
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВТ_Результат
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.ДатаОпер,
	|	ВТ_Результат.СуммаВсего
	|";
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("ОтчетнаяДата", ОтчетнаяДата);
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.Выкуп);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.НачислениеДивидендов);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.НачислениеДоходаПрочие);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.ПогашениеНКД);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.ПогашениеЦБПолное);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.ПогашениеЦБЧастичное);
	Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций);
	ВидыОперацийНеПроценты = Новый Массив;
	ВидыОперацийНеПроценты.Добавить(Справочники.ВидыОпераций.ПогашениеЦБПолное);
	ВидыОперацийНеПроценты.Добавить(Справочники.ВидыОпераций.ПогашениеЦБЧастичное);
	Запрос.УстановитьПараметр("ВидыОперацийНеПроценты", ВидыОперацийНеПроценты);
	ТипыЦБ_55211 = Перечисления.ТипыЦБ.ВсеТипыДепозитарныхРасписок();
	ТипыЦБ_55211.Добавить(Перечисления.ТипыЦБ.Облигация);
	Запрос.УстановитьПараметр("ТипыЦБ_55211", ТипыЦБ_55211);
	ТипыЦБ_55310 = Перечисления.ТипыЦБ.ВсеТипыДепозитарныхРасписок();
	ТипыЦБ_55310.Добавить(Перечисления.ТипыЦБ.Акция);
	ТипыЦБ_55310.Добавить(Перечисления.ТипыЦБ.Облигация);
	Запрос.УстановитьПараметр("ТипыЦБ_55310", ТипыЦБ_55310);
	ИнострРезидентКонтрольИнострНедружественный
		= Справочники.КатегорииРолейКлиентовСогласноУказов81и95.ИностранныйРезидентПодКонтролемИностранныхЛицИзНедружественныхСтран;
	Запрос.УстановитьПараметр("ИнострРезидентКонтрольИнострНедружественный", ИнострРезидентКонтрольИнострНедружественный);
	ИнострРезидентКонтрольИнострДружественный
		= Справочники.КатегорииРолейКлиентовСогласноУказов81и95.ИностранныйРезидентПодКонтролемИностранныхЛицИзДружественныхСтран;
	Запрос.УстановитьПараметр("ИнострРезидентКонтрольИнострДружественный", ИнострРезидентКонтрольИнострДружественный);
	ИнострРезидентОтвечаетТребованиямПункта12Указа95
		= Справочники.КатегорииРолейКлиентовСогласноУказов81и95.ИностранныйРезидентУдовлетворяющийТребованиямП12Указа95;
	Запрос.УстановитьПараметр("ИнострРезидентОтвечаетТребованиямПункта12Указа95", ИнострРезидентОтвечаетТребованиямПункта12Указа95);
	Запрос.УстановитьПараметр("ТипыДепозитарныхРасписок", Перечисления.ТипыЦБ.ВсеТипыДепозитарныхРасписок());
	КодыБезВалюты = Новый Массив;
	КодыБезВалютыСтрокой = "DOL3,DOL4,DOL5,DOL7,OTH3,OTH4";
	КодыБезВалюты = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КодыБезВалютыСтрокой);
	Запрос.УстановитьПараметр("КодыБезВалюты", КодыБезВалюты);
	ОписаниеОшибок = "";
	НомерЛицензииБанка = РегуляторнаяОтчетность.НомерЛицензии(Организация, Справочники.ВидыЛицензий.БанковскаяДеятельность);
	Если ПустаяСтрока(НомерЛицензииБанка) Тогда
		ОписаниеОшибок = "Не указан номер банковской лицензии в списке лицензий организации" + Строка(Организация);
	КонецЕсли;
	Запрос.УстановитьПараметр("НомерЛицензииБанка", НомерЛицензииБанка);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	Данные_1_2 = РегуляторнаяОтчетность.РезультатВВидеТЗПоНомеруВПакетеСКонца(РезультатПакета, 1);
	ДанныеПодраздела_1_2.Загрузить(Данные_1_2);
	ПронумероватьСтрокиПодраздела_1_2(ДанныеПодраздела_1_2);
	ДанныеЭмитента = РегуляторнаяОтчетность.РезультатВВидеТЗПоНомеруВПакетеСКонца(РезультатПакета, 2);
	ПроверитьДанныеЭмитента(ДанныеЭмитента);
	ДанныеНерезидента = РегуляторнаяОтчетность.РезультатВВидеТЗПоНомеруВПакетеСКонца(РезультатПакета, 3);
	ПроверитьКодСтраныНерезидента(ДанныеНерезидента);
	ДанныеЦБ = РегуляторнаяОтчетность.РезультатВВидеТЗПоНомеруВПакетеСКонца(РезультатПакета, 4);
	ПроверитьДанныеЦБ(ДанныеЦБ);
	ДанныеДляРасшифровки = РегуляторнаяОтчетность.РезультатВВидеТЗПоНомеруВПакетеСКонца(РезультатПакета, 5);
	РегуляторнаяОтчетность.ПронумероватьСтроки(ДанныеДляРасшифровки);
	
КонецПроцедуры
// BSLLS:MethodSize-on

// Процедура выгружает сформированный отчет (данные в табличных частях отчета) в XML-файл
// Параметры:
//	ОписаниеОшибок - Строка
//	ПроверкиУспешны - Булево
Процедура ВыгрузитьВXML(ОписаниеОшибок, ПроверкиУспешны) Экспорт
	
	// BSLLS:Typo-off
	СписокОбязательныхКолонок = "РегнКОФил, НомСтроки2, К1, К2, ДатаОпер, КодВидВалОпер, КодИнструмента, КодОп"
								+ ", КодНПл, КодВлПл, НаимРезидент, НаимНерезидент, КодСтраны";
	// BSLLS:Typo-on
	МетаданныеТЧ = Метаданные().ТабличныеЧасти.ДанныеПодраздела_1_2;
	ПроверкиУспешны = РегуляторнаяОтчетность.ЗаполненыОбязательныеКолонкиДляВыгрузкиВXML(ДанныеПодраздела_1_2, МетаданныеТЧ,
													СписокОбязательныхКолонок + ", К3, СуммаВсего", "НомСтроки2", ОписаниеОшибок);
	Если Не ПроверкиУспешны Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормы = "0409405";
	ПространствоИмен = "urn:cbr-ru:rep0409405:v4.0.4.5";
	
	// Осторожно! Схема хранимая в конфигурации модифицирована по сравнению с оригинальной:
	//	- добавлен тип: "Строка19"
	//	- в разделе ""Ф0409405Данные405Раздел1Подраздел2строка" для атрибута КолЦб тип "десят19.4-лок" заменен на "Строка19"
	// Это потребовалось, чтобы все числа можно было выгрузить в файл дополненными до 6 нулей после запятой (см. NRB-362)
	СхемаXSD = ПолучитьМакет("Ф405_Schema_XSD");
	Фабрика = РегуляторнаяОтчетность.ФабрикаИзСхемыXSD(СхемаXSD);
	Отчетность = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409405"));
	
	УникИдОЭС = Новый УникальныйИдентификатор;
	Отчетность.УникИдОЭС = Строка(УникИдОЭС);	// Пример: "8b91f09d-da8b-11ed-811d-00155d1a3509";
	Отчетность.ВидОтчета = "КО";
	Отчетность.КодФормы = ИмяФормы;
	Отчетность.ОКУД = ИмяФормы;
	Отчетность.ВидОЭС = "Отчетность КО";
	Отчетность.ВидОтчета = "основной";
	Отчетность.Периодичность = "месячная";
	Отчетность.ДатаВремяФормирования = ТекущаяДатаСеанса();
	// BSLLS:Typo-off
	Отчетность.ОтчДата = ОтчетнаяДата;
	// BSLLS:Typo-on
	
	Отчетность.Составитель = СоставительОтчета(Фабрика, ПространствоИмен);
	
	Отчетность.Данные405 = Данные405(Фабрика, ПространствоИмен, СписокОбязательныхКолонок);
	
	РегуляторнаяОтчетность.ЗаписатьОтчетностьДляДельтыВXML(Фабрика, Отчетность, ИмяФормы, ПериодНачало, ПериодКонец);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция СоставительОтчета(Фабрика, ПространствоИмен)
	Составитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409405Составитель"));
	
	Составитель.Руководитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409405СоставительРуководитель"));
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОтветственномЛице(Составитель.Руководитель, Организация,
								Перечисления.ОтветственныеЛицаОрганизаций.ПодписантВРегуляторнойОтчетности, ОтчетнаяДата);
		
	Составитель.Исполнитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409405СоставительИсполнитель"));
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОтветственномЛице(Составитель.Исполнитель, Организация,
								Перечисления.ОтветственныеЛицаОрганизаций.ИсполнительВРегуляторнойОтчетности, ОтчетнаяДата);
	
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОрганизации(Составитель, Организация, ОтчетнаяДата);
	
	Возврат Составитель;
КонецФункции

Функция Данные405(Фабрика, ПространствоИмен, СписокОбязательныхКолонок)
	Данные405 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409405Данные405"));
	Данные405.Ид = "1";
	
	Данные405.Раздел1Подраздел2 = Подраздел1_2(Фабрика, ПространствоИмен, СписокОбязательныхКолонок);
	
	Возврат Данные405;
КонецФункции

Функция Подраздел1_2(Фабрика, ПространствоИмен, СписокОбязательныхКолонок)
	Подраздел1_2 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409405Данные405Раздел1Подраздел2"));
	
	КолонкиСЧислами = "СуммаВсего, СуммаДоход, Налог";
	КопируемыеВсегдаКолонки = СписокОбязательныхКолонок + ", " + КолонкиСЧислами;
	
	Для каждого Данные Из ДанныеПодраздела_1_2 Цикл
		СтрокаПодраздела = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409405Данные405Раздел1Подраздел2строка"));
		// BSLLS:Typo-off
		ЗаписьПроЦБ = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409405Данные405Раздел1Подраздел2строказапись"));
		// BSLLS:Typo-on
		ЗаписьПроЦБ.К3 = Данные.К3;
		РегуляторнаяОтчетность.ПрисвоитьНепустое(ЗаписьПроЦБ.НаимЭмЦб, Данные.НаимЭмЦб);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(ЗаписьПроЦБ.КодЭмЦб, Данные.КодЭмЦб);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(ЗаписьПроЦБ.РегНомЦб, Данные.РегНомЦб);
		СтрокаПодраздела.Запись.Добавить(ЗаписьПроЦБ);
		
		ЗаполнитьЗначенияСвойств(СтрокаПодраздела, Данные, КопируемыеВсегдаКолонки);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.КодРезидент, Данные.КодРезидент);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ДатаРегВып, Данные.ДатаРегВып);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ДатаПогашЦб, Данные.ДатаПогашЦб);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.КодВлЦб, Данные.КодВлЦб);
		Данные.ПримТЕКСТ = Лев(Данные.ПримТЕКСТ, 5);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ПримТЕКСТ, Данные.ПримТЕКСТ);
		
		// Осторожно! Схема хранимая в конфигурации модифицирована по сравнению с оригинальной:
		//	- добавлен тип: "Строка19"
		//	- в разделе ""Ф0409405Данные405Раздел1Подраздел2строка" для атрибута КолЦб тип "десят19.4-лок" заменен на "Строка19"
		// Это потребовалось, чтобы все числа можно было выгрузить в файл дополненными до 6 нулей после запятой (см. NRB-362)
		СтрокаПодраздела.КолЦБ = Формат(Данные.КолЦБ, "ЧДЦ=4; ЧРД=.; ЧН=; ЧГ=");
		
		Подраздел1_2.Строка.Добавить(СтрокаПодраздела);
	КонецЦикла;
	
	Возврат Подраздел1_2;
КонецФункции

Процедура ПроверитьКодСтраныНерезидента(ДанныеНерезидента)
	Для каждого Данные Из ДанныеНерезидента Цикл
		Сущность = "Код страны";
		Если Данные.ДепонентыНеРезидент Тогда
			Принадлежность = "Юр/Физ. лица депонента";
			Владелец = Данные.Депонент;
		Иначе
			Принадлежность = "Юр/Физ. лица эмитента";
			Владелец = Данные.Эмитент;
		КонецЕсли;
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, Сущность, Принадлежность, Данные.КодСтраны, Владелец, 3, Истина);
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеЭмитента(ДанныеЭмитента)
	Для каждого Данные Из ДанныеЭмитента Цикл
		Принадлежность = "Юр/Физ. лица эмитента";
		Владелец = Данные.Эмитент;
		Если Данные.ЭмитентНеРезидент Тогда
			Длина = 3;
			Сущность = "Код страны";
		Иначе
			Длина = РегуляторнаяОтчетность.ДопустимыеДлиныИНН();
			Сущность = "ИНН";
		КонецЕсли;
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, Сущность, Принадлежность, Данные.КодЭмЦб, Владелец, Длина);
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеЦБ(ДанныеЦБ)
	Для каждого Данные Из ДанныеЦБ Цикл
		Если Не ЗначениеЗаполнено(Данные.КодВалютыНоминала) И Не Данные.ВалютаНоминалаНеТребуется Тогда
			Если ЗначениеЗаполнено(Данные.БазовыйАктивДепозитарнойРасписки) Тогда
				ВидОшибки = "не указана валюта номинала базового актива";
			Иначе
				ВидОшибки = "не указана валюта номинала";
			КонецЕсли;
			ОписаниеОшибки = РегуляторнаяОтчетность.ОписаниеОшибкиЦБ(Данные.ЦеннаяБумага, ВидОшибки, Данные.ISIN, Данные.РегНомер);
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если ЗначениеЗаполнено(Данные.БазовыйАктивДепозитарнойРасписки) И Не ЗначениеЗаполнено(Данные.НоминалДепозитарнойРасписки) Тогда
			ВидОшибки = "не указан номинал базового актива";
			ОписаниеОшибки = РегуляторнаяОтчетность.ОписаниеОшибкиЦБ(Данные.ЦеннаяБумага, ВидОшибки, Данные.ISIN, Данные.РегНомер);
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "Код валюты", "ценной бумаги", 
														Данные.КодВалютыНоминала, Данные.ЦеннаяБумага, 3);
	КонецЦикла;
КонецПроцедуры

// Нумерует строки в данных и заполняет колонку N1 с банковской лицензией организации
// Параметры:
//	Строки - ТабличнаяЧасть - Табличная часть или таблица значений
Процедура ПронумероватьСтрокиПодраздела_1_2(Строки) Экспорт
	НомСтр = 0;
	Для каждого Строка Из Строки Цикл
		НомСтр = НомСтр + 1;
		Строка.НомСтроки2 = "1.2." + Формат(НомСтр, "ЧГ=");
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти
